In [1]:
#JSON SQL

In [2]:
#JSON : Java Script On Notation : Universal format
# important usecase: response from API is generally in the json format
# Multiple languages can parse JSON : java python

In [3]:
#SQL : Structured Query Language
#Directly loading the data from database to pandas dataframe

# Working with JSON

In [1]:
import pandas as pd

In [2]:
pd.read_json('train.json')

          id      cuisine                                        ingredients
0      10259        greek  [romaine lettuce, black olives, grape tomatoes...
1      25693  southern_us  [plain flour, ground pepper, salt, tomatoes, g...
2      20130     filipino  [eggs, pepper, salt, mayonaise, cooking oil, g...
3      22213       indian                [water, vegetable oil, wheat, salt]
4      13162       indian  [black pepper, shallots, cornflour, cayenne pe...
...      ...          ...                                                ...
39769  29109        irish  [light brown sugar, granulated sugar, butter, ...
39770  11462      italian  [KRAFT Zesty Italian Dressing, purple onion, b...
39771   2238        irish  [eggs, citrus fruit, raisins, sourdough starte...
39772  41882      chinese  [boneless chicken skinless thigh, minced garli...
39773   2362      mexican  [green chile, jalapeno chilies, onions, ground...

[39774 rows x 3 columns]

# Working with SQL

In [3]:
# download the sql dataset from kaggle

In [4]:
# Then we will need a software : xammp
# after downloading go to xampp control panel 
# start apache (webserver) and mysql (database server)

In [6]:
#I experienced an error : Error: MySQL shutdown unexpectedly.
# Corrected the error : following this video 
# https://www.youtube.com/watch?v=84IOtc05TuA
# and the comment

In [7]:
# after that we need to add one url to our local machine
# localhost/phpmyadmin/

In [9]:
#new database
#named it world
#create
#then import from file world.sql
#we obtain multiple tables

In [10]:
# Now we need to convert these data to pandas dataframe

In [11]:
# We need a library installed mysql.connecter which acts as bridge to make python talk with mysql

In [12]:
!pip install mysql.connector

Collecting mysql.connector
  Downloading mysql-connector-2.2.9.tar.gz (11.9 MB)
     ---------------------------------------- 0.0/11.9 MB ? eta -:--:--
     -- ------------------------------------- 0.8/11.9 MB 8.5 MB/s eta 0:00:02
     ------- -------------------------------- 2.1/11.9 MB 6.5 MB/s eta 0:00:02
     ---------------------- ----------------- 6.6/11.9 MB 13.0 MB/s eta 0:00:01
     ---------------------------------- ---- 10.5/11.9 MB 14.9 MB/s eta 0:00:01
     --------------------------------------- 11.9/11.9 MB 14.5 MB/s eta 0:00:00
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Building wheels for collected packages: mysql.connector
  Building wheel for mysql.connector (setup.py): started
  Building wheel for mysql.connector (setup.py): finished with status 'done'
  Created wheel for mysql.connector: filename=mysql_connector-2.2.9-cp312-cp312-win_amd64.whl size=247959 sha256=fd04c8113d3b15ad969985988cc9c6d144fa8e6b5ca24b4280a3d7c92b242bb3
  Stored in directory: c:\users\subed\appdata\local\pip\cache\wheels\03\17\fa\d7604c72dd3dd6d3eb3d249abf36cc532c9a9b4354b8f1bc4f
Successfully built mysql.connector
Installing collected packages: mysql.connector
Successfully installed mysql.connector-2.2.9

In [13]:
import mysql.connector

In [14]:
#create one connection through python to database

In [16]:
conn = mysql.connector.connect(host='localhost', user='root', password='', database = 'world')
                        #database server ip address, ...

In [17]:
#mysql connect object obtained

In [18]:
pd.read_sql_query("SELECT * FROM city", conn)
    #suppose i need city table

C:\Users\subed\AppData\Local\Temp\ipykernel_12680\2613618342.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT * FROM city", conn)

        ID            Name CountryCode       District  Population
0        1           Kabul         AFG          Kabol     1780000
1        2        Qandahar         AFG       Qandahar      237500
2        3           Herat         AFG          Herat      186800
3        4  Mazar-e-Sharif         AFG          Balkh      127800
4        5       Amsterdam         NLD  Noord-Holland      731200
...    ...             ...         ...            ...         ...
4074  4075      Khan Yunis         PSE     Khan Yunis      123175
4075  4076          Hebron         PSE         Hebron      119401
4076  4077        Jabaliya         PSE     North Gaza      113901
4077  4078          Nablus         PSE         Nablus      100231
4078  4079           Rafah         PSE          Rafah       92020

[4079 rows x 5 columns]

In [20]:
pd.read_sql_query("SELECT * FROM city where CountryCode LIKE 'IND'", conn)

C:\Users\subed\AppData\Local\Temp\ipykernel_12680\680651482.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT * FROM city where CountryCode LIKE 'IND'", conn)

       ID                Name CountryCode        District  Population
0    1024     Mumbai (Bombay)         IND     Maharashtra    10500000
1    1025               Delhi         IND           Delhi     7206704
2    1026  Calcutta [Kolkata]         IND    West Bengali     4399819
3    1027    Chennai (Madras)         IND      Tamil Nadu     3841396
4    1028           Hyderabad         IND  Andhra Pradesh     2964638
..    ...                 ...         ...             ...         ...
336  1360        Ambala Sadar         IND         Haryana       90712
337  1361          Baidyabati         IND    West Bengali       90601
338  1362               Morvi         IND         Gujarat       90357
339  1363             Raigarh         IND     Chhatisgarh       89166
340  1364            Vejalpur         IND         Gujarat       89053

[341 rows x 5 columns]